Tekla Open API Reference for Tekla Structures 2025
WrappingType Enumeration
 Enumeration for wrapping type.
 Namespace: Tekla.Structures.Forming
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WrappingType
Public Enumeration WrappingType
Members
Member name | Value | Description
NOT_SPECIFIED | 0 |  Not specified, default value.
WRAPPED | 1 |  Indicates wrapped item.
UNWRAPPED | 2 |  Indicates unwrapped item.
See Also
Reference
Tekla.Structures.Forming Namespace